<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
<title>Untitled Document</title>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
</head>

<body>
<p><font size="5" color="#000000"><strong>Apostila do Administrador de Web Site</strong></font></p>
<p><font color="#000000" size="3">Esta apostila cont&eacute;m todas as informa&ccedil;&otilde;es 
  para voc&ecirc; gerenciar o seu Web Site. Vamos mostrar passo a passo como trabalhar 
  com as informa&ccedil;&otilde;es contidas no seu site de maneira f&aacute;cil 
  e r&aacute;pida. Disponibilizando para os seus clientes uma intera&ccedil;&atilde;o 
  bem produtiva.</font></p>
<p><font color="#000000" size="3">Primeiro entre na p&aacute;gina<strong> www.imobiliariaveja.com.br/senha.asp:</strong></font></p>
<p><font color="#000000" size="2"><img src="apostila001.jpg" width="519" height="347"></font></p>
<p><font color="#000000" size="3">Voc&ecirc; vai precisar de uma senha e um ID 
  , no exemplo da apostila vou criar uma senha e um ID fict&iacute;cios:</font></p>
<p><font color="#000000" size="3"><strong>ID: entrar</strong></font></p>
<p><font color="#000000" size="3"><strong>Senha: entrar</strong></font></p>
<p><font color="#000000" size="3">Coloque a <strong>senha</strong> e o <strong>ID</strong> 
  no formul&aacute;rio , observe que na caixa de texto da senha as letras v&atilde;o 
  ser digitadas como aster&iacute;sticos ****** , isso &eacute; normal, se trata 
  de um recurso do sistema para maior seguran&ccedil;a. Depois clique em entrar.</font></p>
<p><font color="#000000" size="2"><img src="apostila002.jpg" width="519" height="347"></font></p>
<p><font color="#000000" size="3">Agora voc&ecirc; j&aacute; est&aacute; no administrador 
  do site como mostrado abaixo:</font></p>
<p><font color="#000000" size="3"><img src="apostila003.jpg" width="796" height="316"></font></p>
<p><font color="#000000" size="3">Agora n&oacute;s vamos entender como funciona 
  o administrador:</font></p>
<p><font color="#000000" size="3"><img src="apostila004.jpg" width="796" height="316"></font></p>
<p><font color="#000000" size="3">Veja quais as fun&ccedil;&otilde;es dos n&uacute;meros 
  indicativos:</font></p>
<p><font color="#000000" size="3"><strong>1)</strong> O n&uacute;mero 1s&atilde;o 
  os links para os v&aacute;rios bancos de dados do site, como cidade , proposta, 
  permuta, compradores, im&oacute;veis, mas vamos focar nos im&oacute;veis , se 
  voc&ecirc; souber gerenciar os im&oacute;veis saber&aacute; gerenciar o site 
  inteiro.</font></p>
<p><font color="#000000" size="3"><strong>2)</strong> O n&uacute;mero 2 indica 
  um site de busca de im&oacute;veis por cidade, bairro, negocia&ccedil;&atilde;o, 
  quartos e valor, com esse buscador voc&ecirc; poder&aacute; encontrar im&oacute;veis 
  facilmente , com as caracter&iacute;sticas pedidas por seu cliente.</font></p>
<p><font color="#000000" size="3"><strong>3)</strong> O n&uacute;mero 3 indica 
  um outro tipo de buscador usando propriet&aacute;rio, endere&ccedil;o , telefone, 
  data, primeira p&aacute;gina, standby e c&oacute;digo do im&oacute;vel. Esse 
  buscador &eacute; eficiente para buscar im&oacute;veis com os dados do propriet&aacute;rio 
  e para administrar a primeira p&aacute;gina e o standby.N&oacute;s vamos mostrar 
  mais adiante tudo isso detalhadamente.</font></p>
<p><font color="#000000" size="3">Agora vamos fazer nossa primeira busca:</font></p>
<p><font color="#000000" size="3">Clique em cima da caixa de texto cidade e selecione 
  S&atilde;o Bernardo , logo depois selecione na caixa de texto bairro a vila 
  mussolini. </font></p>
<p><img src="apostila005.jpg" width="796" height="316"></p>
<p><font color="#000000" size="3">Dever&aacute; aparecer uma tela parecida com 
  o mostrado abaixo:</font></p>
<p><img src="apostila006.jpg" width="748" height="519"></p>
<p><font color="#000000" size="3">Agora mostraremos o que significa os indicadores 
  na tela:</font></p>
<p><img src="apostila007.jpg" width="748" height="519"></p>
<p><font color="#000000" size="3"><strong>1)</strong> O n&uacute;mero 1 &eacute; 
  o bot&atilde;o que exclui v&aacute;rios registros no banco de dados.</font></p>
<p><font color="#000000" size="3">Os registros s&atilde;o as informa&ccedil;&otilde;es 
  que voc&ecirc; v&ecirc; na lista apresentada na tela que cont&ecirc;m dados 
  do propriet&aacute;rio , endere&ccedil;o do im&oacute;vel e data, s&atilde;o 
  as informa&ccedil;&otilde;es referentes aos im&oacute;veis.</font></p>
<p><font color="#000000" size="3"><strong>2) </strong>O n&uacute;mero 2 &eacute; 
  um bot&atilde;o que vai abrir um formul&aacute;rio para a inclus&atilde;o de 
  um novo im&oacute;vel.</font></p>
<p><font color="#000000" size="3"><strong>3)</strong> O n&uacute;mero 3 &eacute; 
  o bot&atilde;o que exclui apenas um im&oacute;vel do banco de dados.</font></p>
<p><font color="#000000" size="3"><strong>4)</strong> O n&uacute;mero 4 &eacute; 
  o bot&atilde;o que abre um formul&aacute;rio de visualiza&ccedil;&atilde;o dos 
  dados do im&oacute;vel, l&aacute; voc&ecirc; poder&aacute; ver todos os dados 
  que o im&oacute;vel cont&eacute;m e tamb&eacute;m poder&aacute; atualiza-los 
  se quiser.</font></p>
<p><font color="#000000" size="3"><strong>5)</strong> O n&uacute;mero 5 &eacute; 
  o bot&atilde;o indicando se o im&oacute;vel tem foto ou n&atilde;o, quando tem 
  essa maquininha fotogr&aacute;fica no registro significa que o im&oacute;vel 
  tem foto, e para visualizar essa foto &eacute; s&oacute; passar o mouse por 
  cima da maquininha que o im&oacute;vel ser&aacute; mostrado. Esse bot&atilde;o 
  tamb&eacute;m serve para visualizar os dados do im&oacute;vel e sua poss&iacute;vel 
  atualiza&ccedil;&atilde;o.</font></p>
<p><font color="#000000" size="3">Agora vamos incluir um im&oacute;vel para testar 
  o sistema:</font></p>
<p><font color="#000000" size="3">Clique no bot&atilde;o <strong>incluir</strong> 
  para abrir o formul&aacute;rio de inclus&atilde;o de im&oacute;veis.</font></p>
<p><img src="apostila008.jpg" width="420" height="275"></p>
<p><font color="#000000" size="3">Voc&ecirc; dever&aacute; visualizar algo parecido 
  com a imagem abaixo:</font></p>
<p><img src="apostila009.jpg" width="592" height="488"></p>
<p><font color="#000000" size="3">Esse &eacute; um formul&aacute;rio de inclus&atilde;o 
  de im&oacute;veis, observe que ele cont&ecirc;m caixas de texto para voc&ecirc; 
  colocar todos os dados do im&oacute;vel , tem tamb&eacute;m bot&otilde;es para 
  voc&ecirc; escolher um formul&aacute;rio que envie fotos e um bot&atilde;o para 
  enviar os dados e outro para apagar os dados que voc&ecirc; digitou, &eacute; 
  muito &uacute;til para corrigir erros de digita&ccedil;&atilde;o.</font></p>
<p><font color="#000000" size="3">Agora preencha a caixa de texto propriet&aacute;rio 
  e escreva Roberto, logo depois pode preencher as outras caixas de texto como 
  quiser, mas tente preencher parecido com a imagem abaixo:</font></p>
<p><img src="apostila010.jpg" width="592" height="488"></p>
<p><font color="#000000" size="3">Depois de preencher clique em <strong>enviar</strong>:</font></p>
<p><font color="#000000" size="3">Obs: Se voc&ecirc; digitar algo errado no formul&aacute;rio 
  como por exemplo digitar letra na caixa de texto telefone, uma janelinha ir&aacute; 
  aparecer indicando que voc&ecirc; errou na digita&ccedil;&atilde;o, pois telefone 
  n&atilde;o pode ter n&uacute;mero, o sistema disponibiliza v&aacute;rios corretores 
  nesse formul&aacute;rio, tente preenche-lo o mais corretamente poss&iacute;vel.</font></p>
<p><font color="#000000" size="3">Se a inclus&atilde;o ocorrer normalmente dever&aacute; 
  aparecer uma tela como a mostrada abaixo:</font></p>
<p><img src="apostila011.jpg" width="591" height="167"></p>
<p><font color="#000000" size="3">Agora feche essa janela de inclus&atilde;o de 
  im&oacute;veis e volte sua aten&ccedil;&atilde;o para o administrador:</font></p>
<p><font color="#000000" size="3">Nesse momento incluimos o registro do Roberto 
  em nosso banco de dados, agora vamos procura-lo no banco de dados.</font></p>
<p><font color="#000000" size="3">V&aacute; at&eacute; o sistema de busca de im&oacute;veis 
  que tem os itens proprietario, telefone, data, etc..e logo ao lado escreva e 
  na caixa de texto &quot;roberto&quot;, ao selecione propriet&aacute;rio e clique 
  em buscar.</font></p>
<p><img src="apostila012.jpg" width="748" height="519"></p>
<p><font color="#000000" size="3">Algo parecido com a imagem abaixo dever&aacute; 
  aparecer na sua tela:</font></p>
<p><img src="apostila013.jpg" width="696" height="280"></p>
<p><font color="#000000" size="3">Se por um acaso aparecerem outros registros, 
  n&atilde;o fique preocupado, pois esse sistema rastreou no banco de dados de 
  im&oacute;veis o nome &quot;roberto&quot; de propriet&aacute;rios, se algu&eacute;m 
  tiver o nome ou sobrenome &quot;roberto&quot; tamb&eacute;m aparecer&aacute; 
  no administrador.</font></p>
<p><font color="#000000" size="3">Agora vamos visualizar os dados do &quot;roberto&quot;:</font></p>
<p><font color="#000000" size="3">Clique em visualizar do registro do &quot;roberto&quot;.</font></p>
<p><img src="apostila014.jpg" width="696" height="280"></p>
<p><font color="#000000" size="3">Algo parecido com a imagem abaixo ir&aacute; 
  aparecer:</font></p>
<p><img src="apostila015.jpg" width="588" height="485"></p>
<p><font color="#000000" size="3">Voc&ecirc; pode verificar que todos os dados 
  que voc&ecirc; incluiu est&atilde;o ai. Esse formul&aacute;rio serve para voc&ecirc; 
  ver todos os dados incluidos no banco de dados e serve tamb&eacute;m para atualizar 
  os dados referentes a esse im&oacute;vel. Vamos fazer um teste.</font></p>
<p><font color="#000000" size="3">Na Caixa de texto telefone selecione o n&uacute;mero 
  com o mouse e digite outro n&uacute;mero, depois v&aacute; at&eacute; o final 
  do formul&aacute;rio e clique em atualizar.</font></p>
<p><img src="apostila016.jpg" width="584" height="331"></p>
<p><font color="#000000" size="3">A informa&ccedil;&atilde;o da caixa de texto 
  foi atualizada. Isso pode ser feito com as outras caixas de texto.</font></p>
<p><font color="#000000" size="3">Se voc&ecirc; quiser por exemplo colocar esse 
  im&oacute;vel na p&aacute;gina inicial do site, basta clicar em visualizar do 
  administrador e selecionar na caixa de texto presen&ccedil;a na primeira p&aacute;gina 
  o item incluido, logo depois clique em atualizar. </font></p>
<p><img src="apostila017.jpg" width="590" height="150"></p>
<p><font color="#000000" size="3">Feche o formul&aacute;rio e tente novamente 
  buscar o &quot;roberto&quot; no banco de dados de im&oacute;veis.</font></p>
<p><font color="#000000" size="3">algo parecido com a imagem abaixo vai ser visualizado:</font></p>
<p><img src="apostila018.jpg" width="719" height="206"></p>
<p><font color="#000000" size="3">Voc&ecirc; pode notar que a cor do registro 
  do im&oacute;vel do roberto mudou, est&aacute; em azul escuro, isso porque voc&ecirc; 
  incluiu ele na p&aacute;gina inicial do site. Se voc&ecirc; for visualizar a 
  p&aacute;gina inicial do site o im&oacute;vel do roberto vai estar l&aacute; 
  para os clientes visualizarem.</font></p>
<p><font color="#000000" size="3">Obs: Da mesma maneira que como foi configurado 
  para o im&oacute;vel ficar na p&aacute;gina inicial do site, pode ser configurado 
  para ficar em Standby ou em Standby e p&aacute;gina inicial juntos, por&eacute;m 
  se o im&oacute;vel estiver em Standby ele n&atilde;o aparecer&aacute; na p&aacute;gina 
  inicial.</font></p>
<p><font color="#000000" size="3">Obs: A p&aacute;gina incial tamb&eacute;m pode 
  ser conhecida como primeira p&aacute;gina.</font></p>
<p><font color="#000000" size="3">Quando o im&oacute;vel estiver em Standby ou 
  na p&aacute;gina inicial ele ter&aacute; uma cor diferente , indicada no administrador.</font></p>
<p><img src="apostila019.jpg" width="719" height="234"></p>
<p><font color="#000000" size="3">Agora vamos excluir esse im&oacute;vel , basta 
  clicar no bot&atilde;o excluir do administrador como indica a figura abaixo.</font></p>
<p><img src="apostila020.jpg" width="719" height="234"></p>
<p><font color="#000000" size="3">Voc&ecirc; j&aacute; aprendeu a excluir um im&oacute;vel, 
  mas como excluir v&aacute;rios im&oacute;veis..??</font></p>
<p><font color="#000000" size="3">&Eacute; muito f&aacute;cil, primeiro voc&ecirc; 
  precisa ticar em cada registro que voc&ecirc; deseja excluir.&Eacute; s&oacute; 
  clicar com o mouse em cima.Como mostrado no exemplo abaixo.</font></p>
<p><img src="apostila021.jpg" width="529" height="146"></p>
<p><font color="#000000" size="3">Depois com os registros selecionados(ticados) 
  basta clicar no bot&atilde;o excluir como indica a figura abaixo.</font></p>
<p><img src="apostila022.jpg" width="529" height="146"></p>
<p><font color="#000000" size="3">Pronto os registros selecionados foram excluidos.</font></p>
<p><font color="#000000" size="3">Agora vamos aprender a incluir um im&oacute;vel 
  com foto!!</font></p>
<p><font color="#000000" size="3">V&aacute; no administrador e clique no bot&atilde;o 
  incluir para abrir o formul&aacute;rio de inclus&atilde;o de im&oacute;veis.</font></p>
<p><img src="apostila023.jpg" width="529" height="146"></p>
<p><font color="#000000" size="3">Veja que abriu o formul&aacute;rio de inclus&atilde;o, 
  agora clique no bot&atilde;o cadastramento com foto.</font></p>
<p><img src="apostila024.jpg" width="590" height="151"></p>
<p><font color="#000000" size="3">O formul&aacute;rio de cadastramento com foto 
  parece igual ao formul&aacute;rio comum, mas note as caixas de texto de Foto 
  Grande e Foto Pequena.</font></p>
<p><img src="apostila025.jpg" width="608" height="142"></p>
<p><font color="#000000" size="3">Voc&ecirc; clicando no bot&atilde;o procurar 
  da caixa de texto de foto grande e foto pequena abrir&aacute; para voc&ecirc; 
  uma janela onde voc&ecirc; poder&aacute; procurar uma foto nas pastas do seu 
  computador.</font></p>
<p><img src="apostila026.jpg" width="608" height="142"></p>
<p><img src="apostila027.jpg" width="611" height="359"></p>
<p><font color="#000000" size="3">&Eacute; s&oacute; procurar o arquivo de foto 
  e clicar 2 vezes em cima dele e automatimente o endere&ccedil;o do arquivo vai 
  para a caixa da foto.</font></p>
<p><img src="apostila028.jpg" width="594" height="363"></p>
<p><font color="#000000" size="3">Pronto agora &eacute; s&oacute; preencher as 
  outras caixas de texto e temos a inclus&atilde;o no banco de dados de um im&oacute;vel 
  com foto.</font></p>
<p><font color="#000000" size="3">Para excluir um im&oacute;vel com foto voc&ecirc; 
  faz a mesma coisa que fez para excluir um im&oacute;vel sem foto.</font></p>
<p><font color="#000000" size="3">Obs: A caixa de texto foto pequena se refere 
  a foto que vai aparecer na lista de im&oacute;veis procurados ela deve ser igual 
  a foto grande.D&ecirc; preferencia tenha duas fotos iguais do im&oacute;vel 
  mas de tamanhos diferentes. Para que a foto pequena seja visualizada mais rapidamente.</font></p>
<p><font color="#000000" size="3">Recomendamos os seguintes tamanhos para as fotos 
  dos im&oacute;veis.</font></p>
<p><font color="#000000" size="3">Foto Grande: 400 x 230 pixels</font></p>
<p><font color="#000000" size="3">Foto Pequena: 158 x 90 pixels</font></p>
<p><font color="#000000" size="3">Veja nas imagens abaixo exemplo das fotos.</font></p>
<p><img src="apostila029.jpg" width="728" height="431"><br>
  <br>
  <img src="apostila030.jpg" width="592" height="512"></p>
<p>Agora vamos supor que voc&ecirc; queira colocar mais de uma foto por im&oacute;vel. 
  Esse sistema permite que voc&ecirc; coloque at&eacute; cinco fotos por im&oacute;vel.</p>
<p>Clique no bot&atilde;o incluir do administrador de im&oacute;veis e abra o 
  formul&aacute;rio de inclus&atilde;o.</p>
<p><img src="apostila031.jpg" width="316" height="112"></p>
<p>&nbsp;</p>
<p>Agora digite o nome &quot;Carlos&quot; para o propriet&aacute;rio do im&oacute;vel 
  e acrescente dados fict&iacute;cios a esse im&oacute;vel, fica a seu crit&eacute;rio.</p>
<p><img src="apostila032.jpg" width="612" height="294"></p>
<p>&nbsp;</p>
<p>Depois de incluir o im&oacute;vel do &quot;Carlos&quot; feche o formul&aacute;rio 
  de inclus&atilde;o.</p>
<p>V&aacute; no administrador e visualize todos os im&oacute;veis. Para isso Clique 
  na caixa de texto procurar e depois no bot&atilde;o buscar , n&atilde;o precisa 
  escrever nada.</p>
<p><img src="apostila033.jpg" width="468" height="82"></p>
<p>&nbsp;</p>
<p>Veja o registro do im&oacute;vel do &quot;Carlos em primeiro lugar na lista&quot;</p>
<p><img src="apostila034.jpg" width="720" height="190"></p>
<p>&nbsp;</p>
<p>O registro de im&oacute;vel do &quot;Carlos&quot; n&atilde;o tem nenhuma foto 
  do im&oacute;vel dele, vamos acrescentar algumas fotos para esse registro de 
  im&oacute;vel.</p>
<p>Clique no bot&atilde;o visualizar do admistrador de im&oacute;veis referente 
  ao &quot;Carlos&quot;.</p>
<p><img src="apostila035.jpg" width="720" height="190"></p>
<p>&nbsp;</p>
<p>Voc&ecirc; vai visualizar todos os dados do im&oacute;vel do &quot;Carlos&quot;</p>
<p>&nbsp;</p>
<p><img src="apostila036.jpg" width="588" height="480"></p>
<p>Observe na visualiza&ccedil;&atilde;o do im&oacute;vel do &quot;Carlos&quot; 
  que tem um bot&atilde;o com um sinal de + na parte de cima a sua direita e a 
  esquerda do monitor.</p>
<p><img src="apostila037.jpg" width="588" height="480"></p>
<p>&nbsp;</p>
<p>Clique nesse bot&atilde;o e voc&ecirc; vai visualizar o pequeno formul&aacute;rio 
  para inclus&atilde;o de fotos.</p>
<p><img src="apostila038.jpg" width="592" height="360"></p>
<p>&nbsp;</p>
<p>Esse sistema &eacute; parecido com o anterior para inclus&atilde;o de fotos, 
  mas voc&ecirc; poder&aacute; incluir at&eacute; cinco fotos</p>
<p>se tentar incluir mais de cinco fotos uma mensagem aparecer&aacute; no formul&aacute;rio 
  indicando que n&atilde;o &eacute; poss&iacute;vel mais adicionar fotos a esse 
  im&oacute;vel. </p>
<p>Vamos fazer uma simula&ccedil;&atilde;o, vamos pegar cinco fotos de um disquete 
  e jogar no registro do im&oacute;vel do &quot;Carlos&quot;.</p>
<p>O disquete tem as seguintes fotos:</p>
<p>imovel00001.jpg</p>
<p>imovel00002.jpg</p>
<p>imovel00003.jpg</p>
<p>imovel00004.jpg</p>
<p>imovel00005.jpg</p>
<p>Obs: O &quot;.jpg&quot; do final do arquivo est&aacute; indicando que ele &eacute; 
  um arquivo de imagem, s&oacute; arquivos de imagem poderam ser enviados como 
  foto de im&oacute;vel.</p>
<p>No formul&aacute;rio de inclus&atilde;o de foto clique no bot&atilde;o procurar.</p>
<p><img src="apostila039.jpg" width="346" height="174"></p>
<p>&nbsp;</p>
<p>Dever&aacute; abrir uma janela no windows onde voc&ecirc; poder&aacute; buscar 
  as fotos que est&atilde;o no disquete.</p>
<p>&nbsp;</p>
<p><img src="apostila040.jpg" width="608" height="430"></p>
<p>&nbsp;</p>
<p>Agora abra o disquete, clique duas vezes no item referente ao disquete.</p>
<p>&nbsp;</p>
<p><img src="apostila041.jpg" width="604" height="422"></p>
<p>&nbsp;</p>
<p>Agora clique duas vezes em cima do arquivo &quot;imovel00001&quot; .</p>
<p><img src="apostila042.jpg" width="566" height="384"></p>
<p>&nbsp;</p>
<p>O formul&aacute;rio de inclus&atilde;o de foto dever&aacute; ficar assim.</p>
<p><img src="apostila043.jpg" width="346" height="180"></p>
<p>&nbsp;</p>
<p>Clique em &quot;Enviar&quot; e a foto ser&aacute; enviada para o banco de dados 
  de im&oacute;veis.</p>
<p>Depois de enviada a foto, o formul&aacute;rio de inclus&atilde;o de foto dever&aacute; 
  ficar assim.</p>
<p><img src="apostila044.jpg" width="346" height="178"></p>
<p>Nesse momento a foto j&aacute; est&aacute; dispon&iacute;vel no site, fa&ccedil;a 
  o mesmo procedimento com todas as cinco fotos do disquete.</p>
<p>Inclua todas.</p>
<p>Depois feche todos os formul&aacute;rios e visualize novamente os dados do 
  im&oacute;vel do &quot;Carlos&quot; , voc&ecirc; dever&aacute; visualizar algo 
  parecido com a imagem abaixo:</p>
<p><img src="apostila045.jpg" width="604" height="504"></p>
<p>&nbsp;</p>
<p>Observe os bot&otilde;es &quot;Anterior&quot; e &quot;Pr&oacute;xima&quot; 
  , clique neles para visualizar as outras fotos que voc&ecirc; incluiu no registro 
  do im&oacute;vel do &quot;Carlos&quot;. </p>
<p><img src="apostila046.jpg" width="604" height="504"></p>
<p>&nbsp;</p>
<p>Obs: Lembre-se que isto &eacute; um exemplo, essas fotos que voc&ecirc; acabou 
  de incluir s&atilde;o de im&oacute;veis diferentes, quando o sistema estiver 
  pronto para funcionar voc&ecirc; dever&aacute; colocar fotos apenas do im&oacute;vel 
  correspondente, no caso do &quot;Carlos&quot; dever&atilde;o ser tiradas cinco 
  fotos da casa dele e colocadas da mesma forma que voc&ecirc; fez anteriormente.As 
  fotos de im&oacute;veis diferentes foi apenas para exemplificar, pois as fotos, 
  devem ser sempre do mesmo im&oacute;vel.</p>
<p>&nbsp;</p>
<p>Vamos supor agora que voc&ecirc; queira atualizar os dados do &quot;Carlos&quot; 
  e mudar a cidade e o bairro do im&oacute;vel dele.</p>
<p>Mas a nova cidade e o novo bairro n&atilde;o existem no banco de dados do site....O 
  que fazer..??</p>
<p>Vamos criar uma cidade fict&iacute;cia por exemplo: &quot;Cidadel&acirc;ndia&quot; 
</p>
<p>Tamb&eacute;m criaremos um bairro fict&iacute;cio para essa cidade: &quot;Bairro 
  Central&quot;</p>
<p>N&oacute;s vamos agora mudar a cidade e o bairro do im&oacute;vel do &quot;Carlos&quot;</p>
<p>Clique em visualizar referente ao im&oacute;vel do &quot;Carlos&quot; para 
  abrir o formul&aacute;rio de visualiza&ccedil;&atilde;o</p>
<p><img src="apostila047.jpg" width="500" height="136"></p>
<p>&nbsp;</p>
<p>No formul&aacute;rio visualizar im&oacute;vel do &quot;Carlos&quot; verifique 
  os bot&otilde;es de + dos itens Cidade e Bairro.</p>
<p><img src="apostila048.jpg" width="592" height="156"></p>
<p>&nbsp;</p>
<p>Clique nesses bot&otilde;es e visualize os pequenos formul&aacute;rios de inclus&atilde;o 
  de Cidade e Bairro.</p>
<p>&nbsp;</p>
<p>Abaixo o formul&aacute;rio de inclus&atilde;o de cidade:</p>
<p><img src="apostila049.jpg" width="348" height="176"></p>
<p>Abaixo o formul&aacute;rio de inclus&atilde;o de Bairro.</p>
<p><img src="apostila050.jpg" width="346" height="174"></p>
<p>Vamos incluir agora a cidade Cidadel&acirc;ndia.</p>
<p>Abra o formul&aacute;rio de inclus&atilde;o de cidade e Digite: Cidadel&acirc;ndia</p>
<p>Depois clique em enviar.:</p>
<p><img src="apostila051.jpg" width="348" height="182"></p>
<p>Dever&aacute; aparecer a seguinte imagem.</p>
<p><img src="apostila052.jpg" width="346" height="174"></p>
<p>Feche o formul&aacute;rio de visualiza&ccedil;&atilde;o do im&oacute;vel do 
  &quot;Carlos&quot; e depois abra-o novamente.</p>
<p>Observe que cidadel&acirc;ndia foi inclu&iacute;da nas cidades dispon&iacute;veis.</p>
<p><img src="apostila053.jpg" width="590" height="228"></p>
<p>&nbsp;</p>
<p>Agora vamos incluir um bairro para Cidadel&acirc;ndia que vai se chamar: Bairro 
  Central</p>
<p>Clique no bot&atilde;o + da caixa de texto de bairro:</p>
<p><img src="apostila054.jpg" width="536" height="154"></p>
<p>Com o formul&aacute;rio de inclus&atilde;o de bairro aberto, selecione Cidadel&acirc;ndia 
  e escreva Bairro Central na caixa de texto de bairro e clique em enviar.</p>
<p><img src="apostila055.jpg" width="344" height="178"></p>
<p>Pronto, feche os formul&aacute;rios e abra novamente o formul&aacute;rio de 
  visualiza&ccedil;&atilde;o do im&oacute;vel do &quot;Carlos&quot;.</p>
<p>&eacute; s&oacute; Selecionar Cidadel&acirc;ndia em cidade e Bairro Central 
  em bairro e atualizar o im&oacute;vel do &quot;Carlos&quot;</p>
<p>&nbsp;</p>
<p><img src="apostila056.jpg" width="590" height="504"></p>
<p>&nbsp;</p>
<p>Agora vamos excluir esse im&oacute;vel do &quot;Carlos&quot;</p>
<p>V&aacute; no administrador e clique no bot&atilde;o excluir referente ao registro 
  do &quot;Carlos&quot;</p>
<p><img src="apostila057.jpg" width="525" height="218"></p>
<p>&nbsp;</p>
<p>Vamos agora excluir a cidade de Cidadel&acirc;ndia.</p>
<p>V&aacute; no administrador e clique no bot&atilde;o cidades</p>
<p><img src="apostila058.jpg" width="604" height="464">.</p>
<p>&nbsp;</p>
<p>Dever&aacute; aparecer a seguinte imagem.</p>
<p><img src="apostila059.jpg" width="576" height="254"></p>
<p>Para excluir Cidadel&acirc;ndia &eacute; s&oacute; clicar no bot&atilde;o excluir 
  referente a Cidadel&acirc;ndia.</p>
<p><img src="apostila060.jpg" width="576" height="254"></p>
<p>Quando voc&ecirc; excluiu Cidadel&acirc;ndia, automaticamente Bairro Central 
  foi excluido, pois quando uma cidade &eacute; excluida, automaticamente todos 
  os seus bairro s&atilde;o exclu&iacute;dos do banco de dados.</p>
<p>Agora n&oacute;s vamos trabalhar com o banco de dados de permuta.</p>
<p>Vamos tentar cruzar informa&ccedil;&otilde;es sobre permuta e tentar visualizar 
  im&oacute;veis que possam ser eventualmente permutados.</p>
<p>Clique no bot&atilde;o Permuta do administrador.</p>
<p>&nbsp;</p>
<p><img src="apostila061.jpg" width="730" height="264"></p>
<p>&nbsp;</p>
<p>Agora clique no bot&atilde;o buscar do formul&aacute;rio procurar propriet&aacute;rio.</p>
<p>&nbsp;</p>
<p><img src="apostila062.jpg"></p>
<p>&nbsp;</p>
<p>Dever&aacute; aparecer a seguinte imagem.</p>
<p><img src="apostila063.jpg" width="682" height="412"></p>
<p>&nbsp;</p>
<p>Clique agora em &quot;Fa&ccedil;a a compara&ccedil;&atilde;o das permutas&quot;</p>
<p>&nbsp;</p>
<p><img src="apostila064.jpg" width="625" height="178"></p>
<p>&nbsp;</p>
<p>Dever&aacute; aparecer a seguinte imagem.</p>
<p>&nbsp;</p>
<p><img src="apostila065.jpg" width="736" height="440"></p>
<p>&nbsp;</p>
<p>Esse &eacute; um formul&aacute;rio de compara&ccedil;&atilde;o de permuta. 
  Se voc&ecirc; quiser verificar quem quer permutar im&oacute;vel em S&atilde;o 
  Bernardo, &eacute; s&oacute; selecionar cidade atual S&atilde;o Bernardo e cidade 
  pretendida tamb&eacute;m S&atilde;o Bernardo e voc&ecirc; poder&aacute; verificar 
  poss&iacute;veis permutantes na cidade de S&atilde;o Bernardo. Quanto mais caixas 
  de texto voc&ecirc; seleciona, mais dif&iacute;cil fica para encontrar um permutante.</p>
<p>Vamos fazer um teste.</p>
<p>Selecione Cidade atual : S&atilde;o Bernardo</p>
<p>Selecione Cidade pretendida: S&atilde;o Bernardo</p>
<p>Selecione Bairro atual: qualquer um</p>
<p>Selecione Bairro pretendido: qualquer um</p>
<p> e clique em procurar.</p>
<p>&nbsp;</p>
<p><img src="apostila066.jpg" width="484" height="300"></p>
<p>&nbsp;</p>
<p>Algo parecido com a imagem abaixo dever&aacute; ser visualizado.</p>
<p><img src="apostila067.jpg" width="724" height="426"></p>
<p>&nbsp;</p>
<p>Todos os registros que aparecem querem comprar e vender im&oacute;veis em S&atilde;o 
  Bernardo, o sistema cruza as informa&ccedil;&otilde;es. Fa&ccedil;a v&aacute;rias 
  tentativas escolhendo tipo do im&oacute;vel, valor, quantos quartos e v&aacute; 
  aprendendo como lidar com sistema de cruzamento de permutas.</p>
<p>&nbsp;</p>
<p>&nbsp;</p>
<p>&nbsp;</p>
<p>&nbsp;</p>
<p>&nbsp;</p>
<p>&nbsp;</p>
<p>&nbsp;</p>
<p>&nbsp;</p>
<p>&nbsp;</p>
<p>&nbsp;</p>
<p>&nbsp;</p>
<p>&nbsp;</p>
<p>&nbsp;</p>
<p>&nbsp;</p>
<p>&nbsp;</p>
<p>&nbsp;</p>
<p>&nbsp;</p>
<p>&nbsp;</p>
<p>&nbsp;</p>
<p>&nbsp;</p>
<p>&nbsp;</p>
<p>&nbsp;</p>
<p>&nbsp;</p>
<p>&nbsp;</p>
<p>&nbsp;</p>
<p>&nbsp;</p>
<p>&nbsp;</p>
<p>&nbsp;</p>
<p>&nbsp;</p>
<p>&nbsp;</p>
</body>
</html>
