<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<html>
<head>
<title>Untitled Document</title>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
</head>

<body>
<p>&nbsp;</p>
<p><font face="Verdana, Arial, Helvetica, sans-serif"><strong>Ter ou n&atilde;o 
  ter namorado</strong></font></p>
<p><font face="Verdana, Arial, Helvetica, sans-serif">Quem n&atilde;o tem namorado 
  &eacute; algu&eacute;m que tirou f&eacute;rias n&atilde;o remuneradas de si 
  mesmo. Namorado &eacute; a mais dif&iacute;cil das conquistas. Dif&iacute;cil, 
  porque namorado de verdade &eacute; muito raro. Necessita de adivinha&ccedil;&atilde;o, 
  de pele, saliva, l&aacute;grimas, nuvem, quindim, brisa ou filosofia.<br>
  Paquera, flerte, caso, transa, envolvimento, at&eacute; paix&atilde;o, &eacute; 
  f&aacute;cil. Mas namorado mesmo, &eacute; muito dif&iacute;cil. Namorado n&atilde;o 
  precisa ser o mais bonito, mas ser aquele a quem se quer proteger e, quando 
  se chega ao lado dele, a gente treme, sua frio e quase desmaia pedindo prote&ccedil;&atilde;o. 
  A prote&ccedil;&atilde;o dele n&atilde;o precisa ser parruda, decidida ou bandoleira, 
  basta um olhar de compreens&atilde;o ou mesmo de afilia&ccedil;&atilde;o.<br>
  Quem n&atilde;o tem namorado n&atilde;o &eacute; quem n&atilde;o tem um amor: 
  &eacute; quem n&atilde;o sabe o gosto de namorar. Se voc&ecirc; tem tr&ecirc;s 
  pretendentes, dois paqueras, um envolvimento e dois amantes, mesmo assim, pode 
  n&atilde;o ter nenhum namorado.<br>
  N&atilde;o tem namorado, quem n&atilde;o sabe o gosto da chuva, cinema, sess&atilde;o 
  das duas, medo do pai, sandu&iacute;che de padaria ou drible no trabalho. N&atilde;o 
  tem namorado quem transa sem carinho, quem se acaricia sem vontade de virar 
  sorvete ou lagartixa e quem ama sem alegria. N&atilde;o tem namorado quem faz 
  pactos de amor apenas com a infelicidade. Namorar &eacute; fazer pactos com 
  a felicidade, ainda que r&aacute;pida, escondida, fugida ou imposs&iacute;vel 
  de durar.<br>
  N&atilde;o tem namorado quem n&atilde;o sabe o valor das m&atilde;os dadas, 
  de carinho escondido na hora em que passa o filme, de flor catada no muro e 
  entregue de repente; de poesia de Fernando Pessoa, Vin&iacute;cius de Moraes 
  ou Chico Buarque lida bem devagar; de gargalhado quando se fala junto, ou descobre 
  a meia rasgada; de &acirc;nsia enorme de viajar junto para a Esc&oacute;cia, 
  ou mesmo, de metr&ocirc;, bonde, nuvem, cavalo alado, tapete m&aacute;gico ou 
  foguete interplanet&aacute;rio.<br>
  N&atilde;o tem namorado quem n&atilde;o gosta de dormir agarrado, fazer sesta 
  abra&ccedil;ados, fazer compras juntos. N&atilde;o tem namorado quem n&atilde;o 
  gosta de falar do pr&oacute;prio amor, nem de ficar horas e horas olhando o 
  mist&eacute;rio do outro dentro dos olhos dele, abobalhados de alegria pela 
  lucidez do amor. N&atilde;o tem namorado quem n&atilde;o redescobre a crian&ccedil;a 
  pr&oacute;pria e a do amado e sai com ele para parques, fliperamas, beira d'&aacute;gua, 
  show de Milton Nascimento, bosques enluarados, ruas de sonho ou musical de metr&ocirc;.<br>
  N&atilde;o tem namorado quem n&atilde;o tem m&uacute;sica secreta com ele, quem 
  n&atilde;o dedica livros, quem n&atilde;o recorta artigos, quem n&atilde;o se 
  chateia com o fato de seu bem ser paquerado. N&atilde;o tem namorado, quem ama 
  sem gostar, quem gosta sem curtir; quem curte sem aprofundar.<br>
  N&atilde;o tem namorado quem nunca sentiu o gosto de ser lembrado de repente 
  no fim de semana, na madrugada ou, meio-dia do dia de sol em plena praia cheia 
  de rivais. N&atilde;o tem namorado quem ama sem se dedicar; quem namora sem 
  brincar; quem vive cheio de obriga&ccedil;&otilde;es; quem faz sexo sem esperar 
  o outro ir junto com ele. N&atilde;o tem namorado quem n&atilde;o fala sozinho, 
  n&atilde;o ri de si mesmo e quem tem medo de ser afetivo.<br>
  Se voc&ecirc; n&atilde;o tem namorado &eacute; porque n&atilde;o descobriu que 
  o amor &eacute; alegre e voc&ecirc; vive pensando duzentos quilos de grilos 
  e de medos. Ponha a saia mais leve, aquela de chita e, passeie de m&atilde;os 
  dadas com o ar. Enfeite-se com margaridas e ternuras; escove a alma com leves 
  fric&ccedil;&otilde;es de ternura e esperan&ccedil;a. De alma escovada e cora&ccedil;&atilde;o 
  aberto, saia do quintal de si mesmo e descubra o pr&oacute;prio jardim. Acorde 
  com gosto de caqui e sorria l&iacute;rios para quem passe debaixo da sua janela. 
  Ponha inten&ccedil;&atilde;o de quermesse em seus olhos e beba licor de contos 
  de fadas. Ande como se o ch&atilde;o estivesse repleto de sons de flauta e do 
  c&eacute;u descesse uma n&eacute;voa de borboletas, cada qual trazendo uma p&eacute;rola 
  falante a dizer frases sutis e palavras de galanteria. Se voc&ecirc; n&atilde;o 
  tem namorado &eacute; porque ainda n&atilde;o enlouqueceu aquele pouquinho necess&aacute;rio 
  a fazer a vida parar e de repente parecer que faz sentido.<br>
  </font> </p>
</body>
</html>
